Repository: DmitryObukhov/UCK
Catalog: trunk/uck-flow/*.po
Languages: de

source: +++Program terminated by keyboard interrupt
de: +++Programm durch Benutzer abgebrochen

source: +++ Started: %s
de: +++ Start von: %s

source: +++ Ended with status %d: %s
de: +++ Ende (mit Status %d) von %s

source: No project
de: Kein Projekt

source: Opened project %s
de: Projekt %s geöffnet

source: Select project to create
de: Anzulegendes Projekt auswählen

source: Cannot create directory %s!
de: Verzeichnis %s kann nicht angelegt werden!

source: Cannot copy files to %s!
de: Kann keine Dateien nach %s kopieren!

source: New project %s
de: Neues Projekt %s

source: Select template to use
de: Bitte die zu benutzende Vorlage auswählen

source: Select project to open/create
de: Bitte das zu öffnende/zu erstellende Projekt auswählen

source: UCK TEMPLATE:
de: UCK Vorlage:

source: UCK PROJECT:
de: UCK Projekt

source: Stopping...
de: Wird angehalten...

source: Running...
de: Beschäftigt...

source: Customization failed with error %s
de: Anpassungen fehlgeschlagen. Fehler %s

source: Updated project
de: Projekt wurde nachgeführt

source: +++ Switching logfile to %s
de: +++ Ändere Protokolldatei auf %s

source: +++ Logfile %s opened at %s
de: +++ Protokolldatei %s (geöffnet am %s)

source: Value
de: Wert

source: Comment
de: Kommentar

source: Warning: Cannot override builtin %s
de: Warnung: Kann den eingebauten Namen %s nicht neu belegen

source: Activate to run re-pack ISO file step.
de: Wählt den ISO neu-packen Schritt.

source: Activate to run the cleanup step.
de: Wählt den Aufräumschritt.

source: Activate to run the prepare ISO step.
de: Wählt den Vorbereitungsschritt.

source: Activate to run the unpack INITRD step.
de: Wählt den INITRD Auspack Schritt.

source: Activate to run the unpack ISO step.
de: Wählt den ISO Auspack Schritt.

source: Activate to run the INITRD customization script.
de: Wählt den INITRD Anpass Schritt.

source: Activate to run the ISO customization script.
de: Wählt den ISO Anpass Schritt.

source: Activate to run the re-pack INITRD step.
de: Wählt den INITRD neu-packen Schritt.

source: Activate to run the re-pack root file system step.
de: Wählt den ROOT Dateisystem neu-packen Schritt.

source: Activate to run the root file system customization script.
de: Wählt den ROOT Dateisystem Anpass Schritt.

source: Activate to run the unpack root file system step.
de: Wählt den ROOT Dateisystem Auspack Schritt.

source: Activate to run your test and delivery script.
de: Wählt den Test-/Auslieferungsschritt

source: By pressing the Edit button on the left you can edit the environment for customization of an Ubuntu Live CD ISO image. You can define settings like: location of the original Ubuntu ISO image to customize, location for the data directories used during customization, name of the final customized ISO image and more.
de: Durch Drücken des Edit Knopfes links können Sie die Umgebung für alle Anpass-Schritte eines Ubuntu Live CD ISO Abbilds einrichten. Sie können Einstellungen wie Ort des ISO Abbilds, Name des Zielabbilds, Name des Projekts und vieles mehr einstellen.

source: Cleanup
de: Aufräumen

source: Cleanup the project directory.
de: Aufräumen des Projektverzeichnisses

source: Click the button to edit the project environment.
de: Projektumgebung bearbeiten

source: Create a new project using the default template.
de: Ein neues Projekt unter Verwendung einer Standardvorlage erstellen.

source: Create a new project from a list of project templates.
de: Ein neues Projekt unter Verwendung einer wählbaren Vorlage erstellen.

source: Customize INITRD
de: INITRD Anpassen

source: Customize ISO Image
de: ISO Abbild anpassen

source: Customize Root Filesystem
de: Root Dateisystem anpassen

source: Customizing the list of languages or keyboards that should be available at boot time or preconfiguring the Ubuntu installer to automagically install a localized version of Ubuntu is done in this step.
de: Anpassungen an den Listen der beim Laden von CD verfügbaren Sprachen und Tastaturen oder Vorkonfiguration des Ubuntu Installationsprogramms müssen in diesem Schritt gemacht werden.

source: Follow Log
de: Protokoll verfolgen

source: Generate you new ISO after customization.
de: Nach erfolgter Anpassung ein neues ISO Abbild erzeugen.

source: Here you can define initial steps, like ripping a CD image or copying an ISO image from a central repository, that should be performed before the customization process really starts.
de: Hier werden vorbereitende Aktionen, wie beispielsweise das Erstellen einer ISO Abbilddatei von einer CD/DVD oder das Bereitstellen einer Abbilddatei von zentraler Stelle ausgeführt, bevor der eigentliche Anpassungsprozess gestartet wird.

source: If you need to modify something that is run very early in the boot process of the live CD, before your customized root image is loaded, you will have to modify the initial ram disk (aka INITRD). As for the root file system, the INITRD is stored in a highly compressed read-only form on the Live CD and needs to be unpacked at least once. Note that you will have to repeat this step (and the next two as well) whenever you upgrade/customize the kernel, as the kernel and its initial ram disk must match perfectly. If you do not need to change anything on the INITRD (i.e. you do not perform the next step) you do not need to unpack it, ever.
de: Wenn Sie etwa am Urladeprozess ändern müssen (bevor das angepasste Root Datesystem geladen wird), werden Sie die initiale RAM disk (aka INITRD) ändern müssen. Wie das Root Dateisystem wird auch die INITRD in hochkomrimierter Form gespeichert, sodass sie - mindestens einmal - entpackt werden muss, um Anpassungen daran vorzunehmen. Dieser Schritt (und die nächsten zwei) müssen auch jedes Mal wiederholt werden, wenn der Kernel im Root Dateisystem verändert wurde, da Kernel und INITRD perfekt aufeinander abgestimmt sein müssen. Falls keine Anpassungen der INITRD notwendig sind, können Sie diesen und die folgenden zwei Schritte auch überspringen.

source: In this step you can customize the root file system according to your needs: you can add packges or remove packages, you can add additional languages, you can update the system to contain all the latest and greatest patches and more. You can even start a terminal and run most of the applications in your customized system.
de: Hier können Sie das Root Dateisystem Ihren Anforderungen anpassen: Sie können Softwarepakete hinzufügen und löschen und/oder zusätzliche Sprachpakete installieren und/oder das System auf den neuesten Stand bringen. Sie können sogar ein Terminal oder auch die meisten graphischen Anwendungen im Kontext des angepassten Systems starten!

source: Information on your current project
de: Informationen über das aktuelle Projekt

source: New Parameter
de: Neuer Parameter

source: New from _Template
de: Neu aus _Vorlage

source: Once you are satisfied with your customizations you need to pack the root file system again into the compressed and unchangeable format that is understood by the Live CD. You need to repeat this step whenever you have changed something in the "Customize Root Filesystem" step to make your changes available on your customized Live CD. This step may take a long time, as squeezing the file system is a time consuming operation.
de: Wenn Sie mit allen Anpassungen fertig sind, muss das Root Dateisystem wieder komprimiert werden, damit es auf der CD Platz hat. Diesen Schritt müssen sie jedesmal wiederholen, wenn Sie Änderungen am Root Dateisystem vorgenommen haben. Dieser Schritt ist sehr zeitaufwendig!

source: Once you have created a project, enable this action to unpack the ISO image into its constituents. You need to do this at least once for every image you want to customize.
de: Sobald Sie ein Projekt neu erstellt und im Vorbereitungsschritt eine ISO Abbilddatei bereitgestellt haben, können Sie diese Aktion markieren um das ISO Abbild in seine Bestandteile zu zerlegen. Diesen Schritt müssen Sie mindestens einmal pro ISO Abbild an dem Sie Anpassungen vornehmen wollen ausführen.

source: Once you have created you customized Live CD, you may want to test it to make sure everything works as intended. Performing this action also allows you to export the ISO image generated in the previous step to some test machine or to your production facility.
de: Wenn Sie mit der Erstellung eines angepassten Live-CD Abbilds fertig sind, sollten Sie das Abbild testen, um sicherzustellen, dass alles wie gewünscht funktioniert. In diesem Schritt können Sie ausserdem Ihr angepasstes ISO Abbild auf eine Testmaschine kopieren oder in die Produktion ausliefern.

source: Open an existing project.
de: Ein existierendes Projekt öffnen

source: Pack INITRD
de: INITRD neu packen

source: Pack ISO File
de: ISO Abbilddatei neu packen

source: Pack Root Filesystem
de: Root Dateisystem neu packen

source: Prepare ISO File
de: Vorbereitungsschritt

source: Press this button to edit the INITRD customization script.
de: INITRD Anpassungen bearbeiten.

source: Press this button to edit the ISO customization script.
de: ISO Abbild Anpassungen bearbeiten.

source: Press this button to edit the test and delivery script.
de: Test- und Auslieferungsprozedur bearbeiten.

source: Press this button to edit the preparation steps.
de: Vorbereitungsschritte bearbeiten.

source: Press this button to edit the project environment.
de: Projekteinstellungen bearbeiten.

source: Press this button to edit the root file system customization script.
de: Root Dateisystem Anpassungen bearbeiten.

source: Quit the uckFlow tool.
de: Das uckFlow Werkzeug verlassen.

source: Re-pack the initial RAM disk after boot-time customization.
de: INITRD nach Änderungen neu packen.

source: Re-pack the root file system after customization.
de: Root Dateisystem nach Änderung neu packen.

source: Ready...
de: Bereit...

source: Run / Edit additional steps to customize you ISO image.
de: ISO Abbild Anpassungen ausführen / bearbeiten.

source: Run / Edit boot-time customization.
de: INITRD Anpassungen ausführen / bearbeiten.

source: Run / Edit steps to prepare the ISO for customization.
de: Vorbereitungsschritte ausführen / bearbeiten.

source: Run / Edit the root file system customization.
de: Root Dateisystem Anpassungen ausführen / bearbeiten.

source: Run / Edit your test and delivery procedure.
de: Test- und Auslieferungsschritte ausführen / bearbeiten.

source: Show project logfile in another window.
de: Projektprotokoll in einem anderen Fenster anzeigen.

source: Some things can only be customized outside of the root file system. For instance if you choose to update your kernel the new kernel and its associated initial ram disk (usually called INITRD) needs to be transferred to the outside of the packed root file system so it can be run at boot time. You may also want to put some additional data on your Live CD that should be accessible without having to boot the Ubuntu Live CD - this is the place to do it.
de: Einige Dinge können nur ausserhalb des Root Dateisystems angepasst werden. Wenn beispielsweise der Kernel und die dazughörige INITRD im Root Dateisystem verändert wurden, müssen sie in diesem Schritt in einen Bereich des ISO Abbilds kopiert werden, wo sie beim Laden von CD zur Verfügung stehen. Ausserdem können sie in diesem Schritt zusätzliche Daten (Beispieldateien oder Programme für andere Betriebssysteme) in das ISO Abbild aufnehmen, oder auch dort schon vorhandene Löschen.

source: Start / Stop processing of the actions activated below.
de: Starten / Beenden der unten angekreuzten Verarbeitungsschritte.

source: Status
de: Ergebnis

source: Test / Deliver
de: Testen / Ausliefern

source: The Ubuntu Customization Kit. http://uck.sourcforge.net
de: Das Ubuntu Customization Kit. http://uck.sourcforge.net

source: This action extracts the Ubuntu root file system that is stored in highly compressed and unchangeable format within the ISO image and stores it as a modifiable directory tree ready to be customized by the subsequent step. You only need to do this once for every root file system you want to modify and you will need plenty of space (currently at least 4GB) for the data.
de: In diesem Schritt wird das auf dem Abbild in unveränderlicher und hoch komprimierter Form gespeicherte Root Dateisystem entpackt, damit es in den weiteren Schritten angepasst werden kann. Diesen Schritt müssen Sie in der Regel nur einmal für jedes ISO Abbild ausführen und sie benötigen viel Speicherplatz (im Moment mindestens 4GB) für das ausgepackte Root Dateisystem.

source: This is the final step that collects all the customization you have done and creates an ISO image of your customized Ubuntu Live CD, ready to be burned and distributed.
de: In diesem Schritt werden alle von Ihnen vorgenommenen Anpassungen gesammelt und aus allen Bestandteilen wieder ein Live CD ISO Abbild zusammengestellt. Dieses Abbild kann direkt auf CD/DVD gebrannt und dann verteilt werden. Sie sollten es vorher aber noch testen!

source: This step repacks the initial ram disk and stores it back on your customized Live CD. Only needed if you have a customized INITRD.
de: In diesem Schritt wird die INITRD wieder neu gepackt und für die Erstellung des ISO Abbilds bereitgestellt. Diesen Schritt müssen sie nur durchführen, wenn die INITRD angepasst wurde.

source: uck-flow - The Ubuntu Customization Kit Flow Tool
de: uck-flow - Das Ubuntu Customization Kit Ablaufsteuerungswerkzeug

source: Unpack INITRD
de: INITRD Auspacken

source: Unpack ISO File
de: ISO Abbild auspacken

source: Unpack Root Filesystem
de: Root Dateisystem auspacken

source: Unpack the initial RAM disk for boot-time customization.
de: INITRD für Anpassungen der Urladerumgebung auspacken

source: Unpack the root file system to perform customization.
de: Root Dateisystem für Anpassungen auspacken.

source: Unpack the source ISO to perform customization.
de: ISO Abbilddatei für Anpassungen auspacken.

source: When you are satisfied with your customized Live CD and you no longer need the expanded versions of your CD, you can select this action which will remove all temporary data. You will be left with the original CD image and the customization scripts you created or modifed for your needs.
de: Wenn Sie mit allen Anpassungen zufrieden sind, brauchen Sie die ausgepackten Teile (Root Dateisystem, INITRD, ...) nicht mehr. Sie können dann durch Auswahl dieser Aktion alle zwischenzeitlich erzeugten Daten löschen.

source: _About
de: _Ueber

source: _Help
de: _Hilfe

source: _New
de: _Neu

source: _Open
de: _Oeffnen

source: _Project
de: _Projekt

source: _Quit
de: _Beenden

source: _Show Log
de: _Protokoll anzeigen

source: _View
de: _Ansicht

source: uckFlow Logfile Viewer
de: uckFlow Protokoll Betrachter
